<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<div>

	<script
		src="https://ajax.googleapis.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
	<script
		src="https://cdnjs.cloudflare.com/ajax/libs/popper.js/1.12.9/umd/popper.min.js"></script>
	<script
		src="https://maxcdn.bootstrapcdn.com/bootstrap/4.0.0/js/bootstrap.min.js"></script>
	<br /> <br /> <br />

	<div class="container">

		<div class="form-group">
			<label for="comment">이용약관:</label>
			<textarea class="form-control" rows="5" id="comment">
      제 1장 총칙
제 1 조 (목적)
본 약관은 군포시 도서관(이하 “도서관”이라 한다)이 제공하는 자료이용을 위하여 도서관 회원가입시 회원과 도서관간에 권리ㆍ의무ㆍ책임사항과 기타 필요한 제반사항을 규정함을 목적으로 한다.

제 2 조 (약관의 효력과 변경)
① 본 약관은 도서관 회원 가입시 약관 내용에 동의하는 경우, 도서관의 자료제공 및 회원의 자료이용에 대하여 이를 적용한다.
② 본 약관은 회원을 위하여 새로운 서비스를 추가하거나, 정책상 중요 사유와 특별한 사정이 발생한 경우에 사전 고지 없이 약관을 변경할 수 있다. 다만, 변경된 약관은 도서관 사이트에 공지하여, 공지와 동시에 그 효력이 발생한다. 회원이 변경된 약관에 동의하지 않는 경우, 본인의 회원가입을 취소할 수 있으며 변경된 약관에 대하여 가입취소가 없으면 동의한 것으로 본다.
제 3 조 (용어의 정의)
본 약관에서 사용하는 용어의 정의는 다음과 같다.

1. “회원”이라 함은 본 약관에 따라 도서관에 개인 정보를 제공하여 회원 가입을 한 자로서 도서관에서 제공하는 자료를 이용할 수 있는 자
2. “가입”이라 함은 도서관에서 제공하는 신청서 양식에 해당 정보를 기입하고 본 약관에 동의하여 회원가입을 완료시키는 행위
3. "회원번호(ID)"라 함은 회원의 식별과 자료이용을 위하여 회원이 희망하는 영문, 숫자 등의 조합(4자리 이상)
4. “비밀번호”라 함은 회원과 회원번호(ID)가 일치하는지를 확인하고 통신상의 자신의 비밀보호를 위하여 회원 자신이 선정한 영문, 숫자 등의 조합(4자리 이상)
5. “탈퇴”라 함은 회원가입자가 이용을 하지 않기로 하여 회원가입을 취소하는 행위이며, 직접 운영자에게 전자메일을 통해 본인임을 알 수 있는 이름,생년월일,성별 , ID, 전화번호, 해지사유를 알려주면, 도서대출 및 가입기록 일치 여부 확인 후 처리한다.
제 4 조 (약관 외 준칙)
본 약관에 명시되지 않은 사항은 관계법령 및 도서관 운영규정에서 정하는 바에 따른다.

제2장 서비스 제공 및 이용
제 5 조 (회원가입)
① 회원가입은 도서관에서 제공한 가입양식에 요구하는 사항을 작성하여 가입을 하는 것으로 성립된다.
② 도서관은 다음 각호의 경우에 대하여 가입을 취소할 수 있다
1. 다른 사람의 명의를 사용하여 신청한 경우
2. 회원 가입 신청서의 내용을 허위로 기재한 경우
3. 다른 사람의 정보를 도용하는 등의 행위를 한 경우
4. 도서관 운영규정 등 관계법령과 본 약관이 금지하는 행위를 하는 경우
제 6 조 (회원 가입정보 사용에 대한 동의)
① 회원가입은 도서관에서 제공한 가입양식에 요구하는 사항을 작성하여 가입을 하는 것으로 성립된다.
② 도서관은 다음 각호의 경우에 대하여 가입을 취소할 수 있다
1. 도서관은 자료제공과 관련하여 회원의 개인정보를 본인의 승낙 없이 누설ㆍ배포하지 않는다. 단, 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있거나 정보통신윤리위원회의 요청이 있는 경우, 또는 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우는 그러하지 않는다.
2. 회원가입후 본인 ID와 비밀번호는 타인에게 알려주어서는 안되며, ID 및 비밀번호 누출에 의한 모든 책임은 본인에게 있다.
③ 본 약관에 따라 회원 가입을 신청하는 것은 도서관 사이트의 신청서에 기재된 정보를 수집ㆍ이용하는 것에 동의하는 것으로 간주한다.
제 7 조 (회원정보의 변경)
① 군포시도서관에서는 다음 각호에 해당하는 경우, 회원과 합의하여 ID를 변경 할 수 있다
1. 회원ID가 회원의 개인정보를 유추 가능한 내용 또는 전화번호 등으로 등록되어 사생활 침해가 우려되는 경우
2. 타인에게 혐오감을 주거나 미풍양속에 어긋나는 경우
3. 기타 합리적인 사유가 있는 경우
② 회원은 이용신청시 기재한 사항에 대하여 변경요인이 발생한 경우에는 온라인 및 기타 적절한 방법으로 수정하여야 하고 미변경으로 인하여 발생되는 문제의 책임은 회원에게 있다.
제3장 의무 및 책임
제 8 조 (도서관의 의무)
① 도서관은 회원이 희망한 자료서비스 제공 개시일에 특별한 사정이 없는 한 서비스를 이용할 수 있도록 하여야 한다.
② 도서관은 개인정보보호를 위해 보안시스템을 구축하여 개인정보보호정책을 홈페이지에 공시하고 준수한다.
제 9 조 (회원의 의무)
① 도서관 회원 가입 절차를 완료하는 순간부터 회원은 입력한 정보의 비밀을 유지할 책임이 있으며, 회원의 ID와 비밀번호 관리소홀, 부정사용 등에 의하여 발생하는 모든 결과에 대한 책임은 회원 본인에게 있다.
② 회원 가입 또는 정보 변경시 본인으로 관련 사항을 정확하게 작성하여야 하며, 허위 또는 타인의 정보를 가입한 경우 회원으로서의 권리 및 혜택을 받을 수 없다.
③ 회원은 본 약관에서 규정하는 사항과 기타 도서관이 정한 제반규정 등 도서관의 관계법령을 준수하여야 한다.
④ 회원은 주소, 연락처, 전자우편 등 이용가입사항이 변경된 경우에 홈페이지를 통해 수정하거나 도서관에 이를 즉시 알려야 한다.
⑤ 회원의 본 약관에 위배되는 행위로 인하여 도서관에 손해가 발생한 경우에는 이를 배상하여야 한다.
제 10 조 (회원의 게시물 관리)
도서관은 회원이 게시하거나 등록한 내용물이 다음 각호에 해당된다고 판단되는 경우 사전 통지 없이 삭제할 수 있다.

1. 타인을 비방하거나 중상모략으로 개인 및 단체의 명예를 손상시키는 내용인 경우
2. 공공질서 및 미풍양속에 위반되는 내용인 경우
3. 범죄적 행위에 부합된다고 인정되는 내용인 경우
4. 타인의 저작권 등 기타의 권리를 침해하는 내용인 경우
5. 기타 관계 법령이나 도서관에서 정한 규정에 위배되는 내용인 경우
부칙
본 약관은 2014년 7월 부터 시행한다.     
      </textarea>
		</div>
	</div>
	<div class="container">
		<form>
			<div class="form-check">
				<label class="form-check-label"> <input type="checkbox"
					class="form-check-input" id="use"> 이용약관에 동의합니다.
				</label>
			</div>
		</form>
	</div>


	<div class="container">
		<br /> <br /> <br />

		<div class="form-group">
			<label for="comment">개인정보수집 동의:</label>
			<textarea class="form-control" rows="5" id="comment">
  1. 개인정보의 수집항목 및 수집방법
군포시 도서관 홈페이지에서는 기본적인 회원 서비스 제공을 위한 필수정보와 정보주체 각각의 기호와 필요에 맞는 서비스를 제공하기 위한 선택정보로 구분하여 다음의 정보를 수집하고 있습니다. 선택정보를 입력하지 않은 경우에도 서비스 이용에는 제한이 없습니다.

가. 수집하는 개인정보의 항목
수집하는 개인정보의 항목
수집하는 필수항목	선택항목
본인인증정보	가입정보	추가 이메일 및
추가 주소
이름, 생년월일, 성별, 휴대폰번호, 통신사,
I-PIN(개인식별번호)	이름,생년월일, 성별,
아이디, 비밀번호, 이메일,
휴대폰번호, 전화번호, 우편번호, 주소
컴퓨터에 의해 자동으로 수집되는 정보
○ 홈페이지를 이용할 경우 다음의 정보는 로그인 기록을 통하여 자동적으로 수집·저장됩니다.
- 접속 로그, 쿠키, 접속 IP 정보, 가입경로
나. 개인정보 수집방법
○ 홈페이지 회원가입을 통한 수집
2. 개인정보의 수집·이용목적 및 보유·이용기간
군포시 도서관 홈페이지에서는 정보주체의 회원 가입일로부터 서비스를 제공하는 기간 동안에 한하여 군포시 도서관 홈페이지 서비스를 이용하기 위한 최소한의 개인정보를 보유 및 이용 하게 됩니다. 회원 탈퇴를 요청하거나 수집/이용목적을 달성하거나 보유/ 이용기간이 종료한 경우, 사업 폐지 등의 사유발생시 당해 개인정보를 지체없이 파기합니다.

개인정보의 수집·이용목적 및 보유·이용기간
수집하는 개인정보의 항목	개인정보의 수집·이용 목적	개인정보의 보유 및 이용기간
이름, 생년월일, 성별, 휴대폰번호, 통신사,I-PIN(개인식별번호)
홈페이지 이용에 따른 본인 식별/인증 절차에이용	I-PIN은 별도로 저장하지않으며본인인증용으로만 이용
이름,생년월일, 성별, I-PIN(개인식별번호),아이디, 비밀번호,우편번호, 주소,전화번호,휴대폰번호, 웹메일	홈페이지 서비스 이용 및 회원관리, 불량회원의 부정 이용 방지, 비인가 사용방지,민원 신청 및 처리, 게시물 등록, 인터넷추첨 및 접수, 전자민원, 본인 의사 확인, 원활한 의사소통 경로의 확보, 설문조사, , 연체도서 관리, 군포시티뉴스 등의 목적으로 공동 이용	회원 탈퇴시까지
추가 이메일 및 추가 주소	비밀번호 분실시 확인, 원활한 의사소통 경로의 확보 등 웹서비스 제공
(이 정보는 선택적 기입 정보로서고객께서 입력하지 않으셔도 서비스 이용 제한은 없음)
정보주체는 개인정보의 수집·이용목적에 대한 동의를 거부할 수 있으며, 동의 거부시 군포시 도서관 홈페이지에 회원가입이 되지 않으며, 군포시 도서관 홈페이지에서 제공하는 서비스를 이용할 수 없습니다.
      </textarea>
		</div>
		<div class="form-check">
			<label class="form-check-label"> <input type="checkbox"
				class="form-check-input" id="user"> 이용약관에 동의합니다.
			</label>
		</div>

	</div>




	
	<div align="center">
		<a href = "/account/createView"><button type="button" disabled id="but" >확인</button></a>
	</div>
</div>
<script>
	$("#use").on("change",function() {
		console.log("flag1");
		if ($("#use").prop("checked") && $("#user").prop("checked")) {
			console.log("flag2");
			$("#but").removeAttr("disabled");
		}
	})
	$("#user").on("change", function() {
		console.log("flag3");
		if ($("#use").prop("checked") && $("#user").prop("checked")) {
			console.log("flag4");
			$("#but").removeAttr("disabled");
		}
	})
	
	
</script>

